import 'package:flutter/material.dart';
import 'package:flutter_bloc/flutter_bloc.dart';

import '../../../../layout/doc_app/cubit/cubit.dart';
import '../../../../layout/doc_app/cubit/states.dart';



class d_PoisonScreen extends StatelessWidget {
  const d_PoisonScreen({Key? key}) : super(key: key);

  @override
  Widget build(BuildContext context) {
    var size = MediaQuery.of(context).size;

    return BlocConsumer<DocCubit , DocStates>(
      listener: (context, state){},
      builder: (context, state) {
        var cubit = DocCubit.get(context);
        Color color = cubit.isDark ? Colors.white: Colors.black;
        return Scaffold(
          appBar: AppBar(),
          body: SingleChildScrollView(
            physics:  BouncingScrollPhysics(),
            child: Padding(
              padding: const EdgeInsets.all(20.0),
              child: Center(
                child: Column(
                  //crossAxisAlignment: CrossAxisAlignment.start,
                  mainAxisAlignment: MainAxisAlignment.start,
                  children: [
                    Directionality(
                      textDirection: TextDirection.rtl,
                      child: Text('تشمل الإسعافات الأولية لتسمم الأطفال باختلاف الحالة كما يأتي',
                        style: TextStyle(
                          fontSize: 18,
                          fontWeight: FontWeight.bold,
                          color: color,

                        ),
                        textAlign:TextAlign.center ,
                      ),
                    ),


                    Container(
                      alignment: Alignment.topCenter,
                      padding: EdgeInsets.only(
                          left: size.width * .1,
                          right: size.width * .02),
                      height: size.height * .48,
                      decoration: BoxDecoration(
                        image: DecorationImage(
                          image: AssetImage("assets/images/poisonn4.jpg"),
                          fit: BoxFit.contain,
                        ),

                      ),
                      //child: BookInfo(size: size,)
                    ),

                    Center(
                      child: Directionality(
                        textDirection: TextDirection.rtl,

                        child: Text(
                          '''
👈التسمم الغذائي:
يحدث عند تناول طعام أو شراب فاسد أو ملوث، وأعراضه الغثيان والقيء والإسهال وتقلصات مؤلمة في البطن وارتفاع في درجة الحرارة، وتختلف حدة الأعراض تبعًا لمدى تلوث الطعام وكمية الطعام المتناولة وقوة الجهاز المناعي للشخص المصاب.
⚠الاسعافات:
•	تقديم كثير من السوائل، خاصة الماء لتعويض السوائل والأملاح المفقودة. 
•	تقديم دواء خافض للحرارة، في حالة ارتفاع درجة حرارة جسم المصاب. 
•	نقل المصاب للمستشفى.

👈التسمم الكيميائي الدوائي:
يحدث عند ابتلاع مواد كيميائية أو دوائية سامة، ومن أعراضه الغثيان والقيء وكثيرًا ما تكون له رائحة مميزة كرائحة اللوز المر في بعض الحالات أو رائحة الثوم في حالات أخرى، وتظهر أعراضه أيضًا في صورة آلام شديدة في البطن أو إسهال، أو في الحالات الشديدة قد تظهر بعض الحروق على الفم مع آلام شديدة في البلعوم والصدر نتيجة لاحتراق المريء.
⚠الاسعافات:
•	مساعده المصاب على التقيؤ وذلك فى حالة التسمم بالادوية.
•	تشجيع المصاب على التقيؤ بلمس مؤخرة سقف حلق المصاب, إذا كان المصاب واعيا.
•	منع زيادة امتصاص السم بإعطاء المصاب مزيجا من الفحم الطبى والماء لأن الفحم يرتبط بالمادة السامة فيمنع إمتصاصها لتخرج مع فضلات المصاب.
•	إذا فقد المصاب وعيه فيمنع إعطائه شيئا بالفم مطلقا.
•	يتم وضع المصاب على جانبه فى وضعية الأفاقة (وضع المريض بعناية على جانبه الأيسر، ويجب ثني أعلى الساق بحيث يكون كل من الورك والركبة بزاوية قائمة) لتأمين مسارات التنفس وضمان إن لا يختنق بقيئه إذا تقيأ.
•	تدفئة جسم المصاب بالأغطية.
•	التأكد من النبض والتنفس وفى حالة توقفهما يتم أجراء الأنعاش القلبى الرئوى.
•	نقل المصاب إلى المستشفى بأسرع ما يمكن.
•	إرسال الدواء الذى تسبب فى التسمم, وما تقيأه المصاب معه إلى المستشفى.
•	إبلاغ الأطباء القائمين على الحالة بتفاصيلها وتفاصيل الحالة الصحية العامة للمصاب وما يتناوله من أدوية وما يعانى منه من أمراض
•	.فى حالة التسمم بالمواد الكاويه يتم تقديم الحليب البارد للمصاب.  لتجنب محاولة تقيؤ هذه المواد، حتى لا تؤذي المريء وتسبب أضرارًا بالغة للجسم.
 


👈التسمم الكيميائي التنفسي:
يحدث عند استنشاق أحد الغازات السامة، وأعراضه سعال شديد وضيق في التنفس، وتشنجات وأحيانًا زرقة في الوجه، وفي بعض الحالات قد تحدث غيبوبة.
⚠الاسعافات:
•	نقل المصاب خارج المكان لمكان به هواء نقي.
•	فك الملابس الضاغطة خاصة على العنق.
•	إجراء تنفس صناعي في حالة حدوث هبوط في التنفس .
•	تدفئة المصاب إذا ظهرت عليه علامات البرد أو القشعريرة.
 

👈التسمم عن طريق الجلد: 
يحدث عند ملامسة الجلد لإحدى المواد السامة ، ما يؤدي إلى إصابة الجلد بأضرار بالغة يجب معالجتها على الفور.
⚠الاسعافات:
-غسل الجلد بتيار من الماء المتدفق مع خلع ملابس المصاب. عدم وضع صابون أو أي مادة كيميائي
 


👈التسمم عن طريق العين: 
-يحدث عند وصول المادة السامة إلى العين سواء عن طريق اللمس المباشر أو الأبخرة والغازات المتصاعدة، مما يؤدي إلى احمرار العينين بشدة، والشعور بألم قوي أو حكة في الجفون أو تشوش الرؤيه.
⚠الإسعافات:
•	فتح الجفنين بأيدٍ نظيفة، ثم غسل العينين بماء متدفق هادئ. 
•	تجنب استخدام أي قطرة طبية لحين الوصول للمستشفى واستشارة الطبيب.
👈التسمم عن طريق الحقن: 
يمكن حدوث التسمم عن طريق الحقن في العضل أو الوريد أو تحت الجلد،، وتظهر أعراضه في صورة طفح جلدي شديد وتورم واحمرار وألم بالجلد، مع ارتفاع في درجة الحرارة، وقد يصاحبه أيضًا صعوبة في التنفس.
⚠الاسعافات:
•	في حالة التسمم عن طريق الحقن بدواء غير مناسب أو مادة كيميائية، يجب نقل المصاب فورًا إلى المستشفى لاتخاذ الإجراءات اللازمة. 

                          ''',
                          textAlign:TextAlign.start ,

                          style: TextStyle(
                            fontWeight: FontWeight.w500,
                            fontSize: 20,
                            color: color,
                          ),
                        ),
                      ),
                    ),


                  ],
                ),
              ),
            ),
          ),
        );
      },
    );
  }
}
